Revit 2024 API
TransmittedModelException Class
The exception thrown when model was transmitted (sent by eTransmit) and insufficient OpenOptions were provided to handle its transmitted flag.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
[SerializableAttribute]
public class TransmittedModelException : InvalidOperationException
Visual Basic
<SerializableAttribute> _
Public Class TransmittedModelException _
	Inherits InvalidOperationException
Visual C++
[SerializableAttribute]
public ref class TransmittedModelException : public InvalidOperationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.TransmittedModelException
See Also
TransmittedModelException Members
Autodesk.Revit.Exceptions Namespace